{
  "backend/main.mo": "Motoko canister implementing core backend logic for user profiles, role-based authorization, tournaments, in-app wallet balances, transactions, top-up and withdrawal requests. It defines domain types, state storage, sorting helpers, and guarded query/update methods for users and admins.",
  "feature_evidence.json": "Structured report mapping high-level product features to frontend files, components, test requirements, and confidence levels. Serves as traceability evidence linking implemented code to feature requirements.",
  "frontend-file-summaries.txt": "Pre-written summaries of all major frontend source files describing their responsibilities across routing, hooks, components, pages, utilities, and localization. Acts as documentation for frontend architecture and feature coverage.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, light/dark theme variables, sidebar colors, and base element styles. Establishes consistent theming and layout styling for the entire frontend.",
  "frontend/index.html": "HTML entry point for the frontend application that mounts the React app and sets basic metadata and page title. Loads the Vite/React main module.",
  "frontend/src/App.tsx": "Root React application configuring TanStack Router, authentication flow, profile setup gating, theme provider, and global query/toast providers. Wires all main routes such as dashboard, tournaments, wallet, admin, top-up, and withdrawal pages.",
  "frontend/src/components/admin/CreateTournamentPanel.tsx": "Admin-only UI panel that provides a form to create new tournaments with name and entry fee. Uses tournament mutation hooks, local tournament ID storage, validation, and toast feedback.",
  "frontend/src/components/admin/TopUpRequestsPanel.tsx": "Admin panel that fetches and displays top-up requests in a table, showing user, amount, and status. Allows approving pending top-ups with loading states and success/error toasts.",
  "frontend/src/components/admin/VerifyTournamentPanel.tsx": "Admin form that verifies a tournament by ID using a mutation hook. Shows success or error feedback via toasts and resets input on success.",
  "frontend/src/components/admin/WithdrawalRequestsPanel.tsx": "Admin panel that lists withdrawal requests with user, amount, payout details, and status. Supports approving requests and marking them completed with corresponding actions and toasts.",
  "frontend/src/components/auth/AccessDenied.tsx": "Displays an access denied message for non-admin users with a button to navigate back to the dashboard.",
  "frontend/src/components/auth/AdminGuard.tsx": "Wrapper component that checks if the current user is an admin before rendering children. Shows a loading spinner or an access denied screen when appropriate.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrated with Internet Identity that handles authentication state, retries edge cases, and clears cached queries on logout.",
  "frontend/src/components/auth/LoginScreen.tsx": "Full-page login screen prompting the user to authenticate with Internet Identity, showing a loading state during login.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog that forces new users to enter and save their display name. Submits profile data via a mutation and shows toast feedback.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header, navigation, content area, and footer. Displays the app logo, current user name, and login button.",
  "frontend/src/components/layout/AppNav.tsx": "Responsive navigation component with mobile and desktop variants. Builds menu items dynamically and includes an admin link when the user is an admin.",
  "frontend/src/hooks/queryKeys.ts": "Centralized definition of React Query keys for user, wallet, admin, top-up, withdrawal, and tournament-related queries.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor based on the current Internet Identity. Reinitializes access control, supports anonymous access, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Provides React Query hooks for fetching and mutating the caller's user profile and role, and checking admin status via the backend actor. Also exposes a combined useAuth hook that reports authentication and admin state using Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider using Dfinity AuthClient to manage login, logout, persisted identity, and detailed login status flags across the app.",
  "frontend/src/hooks/useTopUps.ts": "Defines React Query hooks to create, fetch, and approve top-up requests through the backend actor, with cache invalidation for top-up history and wallet data.",
  "frontend/src/hooks/useTournaments.ts": "Provides mutation hooks to create, verify, and join tournaments via the backend actor, invalidating wallet queries when joining affects balances.",
  "frontend/src/hooks/useWallet.ts": "Exposes React Query hooks to fetch wallet balance and transaction history, plus a helper to invalidate related wallet queries.",
  "frontend/src/hooks/useWithdrawals.ts": "Contains hooks for requesting withdrawals and for admins to fetch, approve, and complete withdrawal requests, with appropriate cache and wallet invalidation.",
  "frontend/src/i18n/index.ts": "Exports a simple translation helper that maps translation keys to Nepali strings and falls back to the key if missing.",
  "frontend/src/i18n/np.ts": "Defines the Nepali translation dictionary covering common UI text, authentication, tournaments, wallet, admin panels, and error messages.",
  "frontend/src/index.css": "Configures Tailwind CSS base layers and defines extensive CSS variables for light and dark themes, including colors, radius, and layout styling.",
  "frontend/src/lib/tournamentStore.ts": "Utility module for persisting tournament IDs in localStorage, with functions to get, add, and remove stored IDs safely.",
  "frontend/src/main.tsx": "Application entry point that initializes React, sets up React Query and Internet Identity providers, and renders the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin-only page wrapped in an AdminGuard that renders a tabbed interface for managing tournaments, verifications, top-up requests, and withdrawal requests.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the main dashboard with a hero section showing the user's wallet balance and quick navigation cards to tournaments, wallet, top-up, and withdraw pages.",
  "frontend/src/pages/TopUpPage.tsx": "Provides a form to request wallet top-ups and displays the user's top-up request history with status indicators.",
  "frontend/src/pages/TournamentDetailPage.tsx": "Displays basic tournament details for a given tournament ID and allows the user to join the tournament with error handling and notifications.",
  "frontend/src/pages/TournamentsPage.tsx": "Allows users to add and manage a local list of tournament IDs and navigate to detailed views for each tournament.",
  "frontend/src/pages/WalletPage.tsx": "Shows the user's current wallet balance and a table of transaction history with translated transaction types.",
  "frontend/src/pages/WithdrawPage.tsx": "Provides a withdrawal request form with provider selection and displays the user's withdrawal request history and statuses.",
  "frontend/src/utils/errorMapping.ts": "Maps common backend or string-based error messages to user-friendly Nepali translations using i18n keys.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions to read URL parameters from query strings or hash-based routes, persist them in sessionStorage, and retrieve or clear them. Includes logic to prioritize URL values, fall back to session storage, and safely handle browser APIs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, container settings, and an extended theme with OKLCH-based color tokens, radii, shadows, and animations. Registers typography, container queries, and animation plugins.",
  "project_state.json": "Machine-readable snapshot of the product roadmap describing a Nepali game platform with wallets, verified tournaments, admin workflows, withdrawals, localization, and core screens. Tracks schema/version metadata and a list of implemented features tied to requirement IDs."
}