{
  "backend/main.mo": "Motoko canister implementing core backend logic for users, tournaments, wallets, top-ups, and withdrawals with role-based access control and persistent state maps. Defines all domain types, error cases, sorting helpers, and public query/update methods for the app.",
  "feature_evidence.json": "Machine-readable report describing implemented frontend branding and theming features, listing affected files, components, test IDs, and confidence levels. Used for feature tracking and verification rather than runtime behavior.",
  "frontend-file-summaries.txt": "Reference document mapping frontend source file paths to short human-written summaries of their responsibilities. Serves as documentation to aid planning and onboarding, not application code.",
  "frontend/index.css": "Global Tailwind CSS base file defining design tokens (colors, radius, surfaces) for light and dark themes and applying them to the app via CSS variables. Establishes the visual theme foundation used across all components.",
  "frontend/index.html": "Static HTML entry point that sets the app title and meta description for branding and SEO and mounts the React application at the root div.",
  "frontend/src/App.tsx": "Main React application entry configuring routing, theming, authentication flow, profile setup gating, and global providers like React Query and Toaster. Also sets the document title and defines all top-level routes.",
  "frontend/src/components/admin/CreateTournamentPanel.tsx": "Admin UI card component that provides a form to create new tournaments, validates input, calls the create tournament mutation, and shows success or error toasts.",
  "frontend/src/components/admin/TopUpRequestsPanel.tsx": "Admin UI panel that lists top-up requests in a table, shows loading skeletons, and allows approving pending requests with mutation handling and status feedback.",
  "frontend/src/components/admin/VerifyTournamentPanel.tsx": "Admin panel card that allows verifying a tournament by ID using a mutation hook, with success/error toasts and localized labels.",
  "frontend/src/components/admin/WithdrawalRequestsPanel.tsx": "Admin panel that lists withdrawal requests in a table, supports approving and marking requests as completed, and handles loading and error states.",
  "frontend/src/components/auth/AccessDenied.tsx": "Displays an access denied card for unauthorized users with a button to navigate back to the dashboard.",
  "frontend/src/components/auth/AdminGuard.tsx": "Route guard component that checks if the caller is an admin, shows a loading spinner, denies access, or renders children accordingly.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button that integrates with Internet Identity, handles authentication state, and clears React Query cache on logout.",
  "frontend/src/components/auth/LoginScreen.tsx": "Full-page login screen prompting users to authenticate via Internet Identity with a branded layout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog that forces new users to enter and save their profile name using an auth mutation with toast feedback.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header, navigation, content area, and footer, displaying user profile info and login controls.",
  "frontend/src/components/layout/AppNav.tsx": "Responsive sidebar and mobile navigation menu that renders route links and conditionally shows an admin section.",
  "frontend/src/hooks/queryKeys.ts": "Centralized definitions of React Query keys for actors, auth state, wallets, withdrawals, and tournaments.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor based on Internet Identity, initializes admin access, and invalidates dependent queries on change.",
  "frontend/src/hooks/useAuth.ts": "Collection of auth-related hooks to fetch and mutate user profiles, roles, and admin status using the backend actor and React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook to manage Internet Identity authentication, including login, logout, persisted identity loading, and detailed login status flags using Dfinity AuthClient.",
  "frontend/src/hooks/useTopUps.ts": "Defines React Query hooks for creating, fetching, and approving top-up requests via a backend actor, with cache invalidation for wallet and top-up data.",
  "frontend/src/hooks/useTournaments.ts": "Contains mutation hooks for creating, verifying, and joining tournaments through the backend actor, with wallet cache invalidation on successful joins.",
  "frontend/src/hooks/useWallet.ts": "Provides query hooks to fetch wallet balance and transaction history from the backend actor, plus a helper to invalidate wallet-related queries.",
  "frontend/src/hooks/useWithdrawals.ts": "Implements React Query hooks for requesting, listing, approving, and completing withdrawal requests, with appropriate cache invalidation of wallet and withdrawal data.",
  "frontend/src/i18n/index.ts": "Exports a simple translation helper that maps typed translation keys to Nepali strings, defaulting to the key if missing.",
  "frontend/src/i18n/np.ts": "Defines a comprehensive Nepali translation dictionary covering common UI text, authentication, tournaments, wallet, top-ups, withdrawals, admin actions, and errors.",
  "frontend/src/index.css": "Sets up Tailwind CSS base styles and extensive CSS variables for light and dark themes, including colors, layout tokens, and global element styling.",
  "frontend/src/lib/tournamentStore.ts": "Provides utility functions to persist, retrieve, add, and remove tournament IDs in localStorage with basic error handling.",
  "frontend/src/main.tsx": "Bootstraps the React application by rendering App with React Query and Internet Identity providers and loading global styles.",
  "frontend/src/pages/AdminPage.tsx": "Renders the admin dashboard guarded by an admin-only wrapper, using tabbed panels to manage tournaments, verification, top-ups, and withdrawals.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the main user dashboard with a hero section showing wallet balance and quick action cards to navigate to tournaments, wallet, top-up, and withdrawal pages. Fetches balance via a wallet hook and shows loading skeletons while data loads.",
  "frontend/src/pages/TopUpPage.tsx": "Provides a form to submit a wallet top-up request and displays the user's top-up request history in a table. Uses hooks to create top-ups, fetch history, validate input, and show status badges with loading states.",
  "frontend/src/pages/TournamentDetailPage.tsx": "Displays basic tournament details based on the route parameter and allows the user to join a tournament. Handles join mutations with success/error toasts and maps backend errors to Nepali messages.",
  "frontend/src/pages/TournamentsPage.tsx": "Shows a list of locally stored tournament IDs and allows users to add new IDs manually. Each tournament card links to a detail page using the router, with empty-state handling and toast feedback.",
  "frontend/src/pages/WalletPage.tsx": "Displays the user's current wallet balance and a transaction history table. Fetches balance and transactions via hooks, formats transaction types and dates, and shows skeletons or empty states as needed.",
  "frontend/src/pages/WithdrawPage.tsx": "Provides a form to request wallet withdrawals with provider selection and payout details, plus a table of past withdrawal requests. Validates input, submits withdrawal mutations, and displays request statuses with badges.",
  "frontend/src/utils/errorMapping.ts": "Defines a helper function that maps common backend or string errors to localized Nepali user-friendly messages using translation keys.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters from query strings or hash-based routes, persist them in sessionStorage, and retrieve or clear them with URL precedence. Includes logic to safely store, restore, and remove sensitive parameters (e.g., admin tokens) without reloading the page.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, dark mode strategy, container defaults, and extensive theme extensions for fonts, colors (CSS variable–driven), border radii, shadows, animations, and plugins. Integrates typography, container queries, and animation plugins for consistent design tokens across the app.",
  "project_state.json": "Machine-readable snapshot of the project’s domain, scope, and implemented features, including authentication, RBAC, profiles, routing, localization, tournaments, and wallet workflows. Used to track schema/versioning, high-level app summary, and detailed feature definitions with requirement mappings."
}