{
  "kind": "build_request",
  "title": "Allow editing app branding for “Nepal Top Up Center” (name + design/theme)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Update the app branding text so the app displays the new brand name \"Nepal Top Up Center\" consistently across the UI (header/logo area) and the browser tab title/metadata.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-16",
          "msg-19"
        ],
        "quotes": [
          "I can change app name and app desine",
          "I can edit my nepal top up center purifier."
        ]
      },
      "acceptanceCriteria": [
        "The primary app name shown in the main layout header uses \"Nepal Top Up Center\".",
        "The document/page title shown in the browser tab uses \"Nepal Top Up Center\".",
        "No user-facing branding text remains as the old app name."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Implement a coherent new visual theme for the \"Nepal Top Up Center\" brand by adjusting Tailwind/CSS theme tokens (colors, typography, surface/background, buttons, cards) and applying them consistently across existing pages (Dashboard, Tournaments, Wallet, Top Up, Withdraw, Admin). Use English for any new user-facing text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-16",
          "msg-19"
        ],
        "quotes": [
          "I can change app name and app desine",
          "I can edit my nepal top up center purifier."
        ]
      },
      "acceptanceCriteria": [
        "All major screens share consistent colors and component styling (cards, buttons, inputs, tables).",
        "The theme works in both light and dark modes (or, if dark mode is disabled, the app remains visually consistent and readable).",
        "Any newly introduced labels/help text are in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in frontend immutablePaths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*.",
    "Backend must remain single-actor; do not introduce additional backend services.",
    "Use English for any new user-facing text in this build request."
  ],
  "nonGoals": [
    "Publishing the app to the Google Play Store (APK/AAB generation, Play Console setup) is out of scope.",
    "Adding new tournament/game features (e.g., Free Fire fields) is out of scope for this request.",
    "Changing wallet/top-up/withdrawal business logic is out of scope for this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}