{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Branding + theme refresh for Nepal Top Up Center (frontend-only)",
  "requirements": [
    {
      "id": "REQ-10",
      "summary": "Update app brand name to “Nepal Top Up Center” across the header/logo area and browser tab metadata.",
      "acceptanceCriteria": [
        "The primary app name shown in the main layout header uses \"Nepal Top Up Center\".",
        "The document/page title shown in the browser tab uses \"Nepal Top Up Center\".",
        "No user-facing branding text remains as the old app name."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Replace the current header branding text with \"Nepal Top Up Center\" and ensure the header/logo area consistently reflects the new brand name across the app."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the HTML document <title> and add/adjust relevant basic metadata (e.g., application/OG title) so the browser tab title/metadata uses \"Nepal Top Up Center\"."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure runtime page title/metadata remains \"Nepal Top Up Center\" after SPA navigation (set document title and any key meta tags at app startup)."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Implement a coherent new visual theme for “Nepal Top Up Center” by updating Tailwind/CSS tokens and applying consistent styling across all major pages (including Admin).",
      "acceptanceCriteria": [
        "All major screens share consistent colors and component styling (cards, buttons, inputs, tables).",
        "The theme works in both light and dark modes (or, if dark mode is disabled, the app remains visually consistent and readable).",
        "Any newly introduced labels/help text are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust global theme tokens (CSS variables) for brand colors, typography defaults, surfaces/backgrounds, borders/rings, and dark-mode equivalents; ensure components using theme tokens remain readable and consistent across light/dark."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Tune Tailwind theme extension (e.g., font families/typography defaults and any brand token mappings) to align with the updated CSS variables and ensure consistent styling utilities across the app."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Refine layout-level styling (header/footer/container/surfaces) to reflect the updated theme tokens consistently across pages without modifying immutable ui components."
        },
        {
          "path": "frontend/src/components/layout/AppNav.tsx",
          "operation": "modify",
          "description": "Adjust navigation wrapper/spacing/background styling to match the new theme (while continuing to use the existing shadcn-ui Button/Sheet/Badge components for consistent variants). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Align dashboard hero, cards, and spacing with the updated theme tokens and shared surface styles; ensure any newly added helper/label text is in English."
        },
        {
          "path": "frontend/src/pages/TournamentsPage.tsx",
          "operation": "modify",
          "description": "Standardize page typography, card/table surfaces, and action styling to match the refreshed theme; keep any new user-facing text in English."
        },
        {
          "path": "frontend/src/pages/WalletPage.tsx",
          "operation": "modify",
          "description": "Update wallet page styling (tables/cards/headers) to use consistent surfaces, borders, and typography under the new theme tokens."
        },
        {
          "path": "frontend/src/pages/TopUpPage.tsx",
          "operation": "modify",
          "description": "Update top-up form and history styling to match the refreshed theme (inputs/buttons/cards), relying on existing shadcn-ui components for consistent visuals. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/WithdrawPage.tsx",
          "operation": "modify",
          "description": "Update withdrawal form and history styling for consistent surfaces and component spacing under the new theme; keep any new text in English."
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Apply consistent theme styling to the Admin screen container, tabs area, and panel spacing so Admin matches the rest of the app (without changing business logic)."
        },
        {
          "path": "frontend/src/components/admin/CreateTournamentPanel.tsx",
          "operation": "modify",
          "description": "Align admin panel card/form styling (spacing, surfaces, typography) with the new theme tokens while keeping existing functionality unchanged."
        },
        {
          "path": "frontend/src/components/admin/TopUpRequestsPanel.tsx",
          "operation": "modify",
          "description": "Update table and action styling to match the refreshed theme and ensure consistent visual hierarchy for request lists."
        },
        {
          "path": "frontend/src/components/admin/WithdrawalRequestsPanel.tsx",
          "operation": "modify",
          "description": "Update request list/table styling (status emphasis, spacing, surfaces) to match the new theme tokens consistently."
        },
        {
          "path": "frontend/src/components/admin/VerifyTournamentPanel.tsx",
          "operation": "modify",
          "description": "Update verify form panel styling to match the refreshed theme, using existing shadcn-ui components. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}